{
	"Delete":"",
	"The source of CodeGen Toolkit has been published now, for more details please refer to {0}":"",
	"Configuration":"",
	"The create button is positioned on the right top corner.":"",
	"Dependencies Updates":"",
	"Edit":"",
	"Download Process":"",
	"Edit Current WorkSpace":"",
	"Friendly Reminder":"",
	"CodeGen need to download some necessary dependencies firstly.":"",
	"PLEASE BE NOTED THIS MESSAGE.":"",
	"CodeGen Toolkit":"",
	"Please Click the button below to start.":"",
	"Workspace Name":"",
	"CodeGen needs to verify these necessary dependencies firstly.":"",
	"Copied a new copy of the workspace, including its data and configuration.":"",
	"Verifying dependencies":"",
	"The client source code of CodeGen Toolkit has been published now, for more details please refer to {0}":"",
	"The name was occupied on your workspaces.":"",
	"Stop Service":"",
	"Docs for CodeGen:":"",
	"Operation Confirmation":"",
	"Our Commitment":"",
	"Close":"",
	"CodeGen will NEVER use the device to launch any kind of attack or abuse.":"",
	"The source is already published, CodeGen Toolkit was built from {0}":"",
	"Manage List":"",
	"Client Toolkit:":"",
	"Cancel":"",
	"CodeGen needs to download these necessary dependencies firstly.":"",
	"Please select the download mirror before downloading":"",
	"About Software":"",
	"Start Service":"",
	"Official Website:":"",
	"Mirror Settings":"",
	"Are you sure that you want to create a copy of the workspace?":"",
	"CodeGen has decided to use {0} as the source for the following process. If the download speed isn't satisfying, please kindly choose another option manually.":"",
	"Please wait a moments":"",
	"Reload Toolkit":"",
	"Manage":"",
	"Name cannot be empty.":"",
	"It seems there's no selected workspace can be edited, please create an accessible workspace firstly":"",
	"View Logs":"",
	"Services":"",
	"CodeGen is aiming to improve developer’s efficiency and save time as much as it can.":"",
	"Global Mirror":"",
	"Are you sure that you want to delete this workspace entirely? This operation is irreversible.":"",
	"Create New WorkSpace":"",
	"Please click the button below to start.":"",
	"Please create your first workspace to start.":"",
	"My WorkSpaces":"",
	"New":"",
	"China Mirror":"",
	"The source of CodeGen Toolkit is already published, regarding to the more detail please refer to {0}":"",
	"Add WorkSpace":"",
	"Start":"",
	"Contact Developer:":"",
	"CodeGen will NEVER analyze or upload your files on this PC.":"",
	"Release an Issue:":"",
	"Set the language successfully! Would you like to restart this application so as to apply the entire changes?":"",
	"Name":"",
	"Open ToolBox":"",
	"Verification Progress":"",
	"Dependencies Verification":"",
	"Source Code:":"",
	"The app configuration will be reinstated after you clicked the confirm button, it's just config rollback, not including the workspaces and related data. Are you sure you want to proceed?":"",
	"Without the user’s definite permission, CodeGen will NEVER read/write your files or execute any unexpected operation.":"",
	"CodeGen need to download some necessary dependencies before the workspace being booted.":"",
	"Workspaces: ":"",
	"We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things. , meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: <br/><ol><li>CodeGen永远不会在这台电脑上分析或上传你的文件。</li><li>CodeGen永远不会使用该设备发动任何形式的攻击或滥用。</li><li>CodeGen的目标是尽可能提高开发人员的效率和节省时间。</li><li>没有用户的明确许可，CodeGen将永远不会读/写您的文件或执行任何意外操作。</li><li>CodeGen是可以脱机使用的软件，这意味着你可以在没有互联网的情况下使用它。</li></ol>":"",
	"Current Version":"",
	"The client source of CodeGen Toolkit has been published now, for more details please refer to {0}":"",
	"Open Source:":"",
	"App Settings":"",
	"CodeGen needs to download these necessary dependencies before the workspace is booted.":"",
	"Please select the mirror before downloading according to your area, meanwhile, please be noted that the downloading speeds will depend consequently on your choice.":"",
	"Binary Distribution:":"",
	"CodeGen Toolkit was built from the CI/CD process on Github":"",
	"Portal for CodeGen:":"",
	"Please select the mirror before downloading according to your area, the downloading speeds will depend consequently on your choice.":"",
	"CodeGen ToolBox":"",
	"Basic Information":"",
	"click the button below to start.":"",
	"CodeGen is offline-able software, which means you can use it as well without the Internet.":"",
	"Auto":"",
	"Language":"",
	"The app configuration will be reinstated after you clicked the confirm button, it will only rollback app config, not including these workspaces and related data. Are you sure you want to proceed?":"",
	"Create":"",
	"Client source has been published, the binary client was built from {0}":"",
	"No, start the service manually.":"",
	"Using {0} as the download mirror":"",
	"AutoRun Services":"",
	"v1.3.0_102":"",
	"Reset Config":"",
	"FilePath":"",
	"Yes, start all services automatically.":"",
	"Manage WorkSpace":"",
	"Create WorkSpace":"",
	"Created new workspace successfully!":"",
	"Okay {0}":"",
	"Click the button below to start.":"",
	"Reinstated! CodeGen will exit to apply this changes":"",
	"User Settings":"",
	"Download Now":"",
	"New WorkSpace":"",
	"We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"",
	"We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things. , meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: <br/><ol><li>CodeGen will NEVER analyze or upload your files on this PC.</li><li>CodeGen will NEVER use the device to launch any kind of attack or abuse.</li><li>CodeGen is aiming to improve developer’s efficiency and save time as much as it can.</li><li>Without the user’s definite permission, CodeGen will NEVER read/write your files or execute any unexpected operation.</li><li>CodeGen is offline-able software, which means you can use it as well without the Internet.</li></ol>":"",
	"Duplicate":"",
	"It seems there's no selected workspace can be edited, please delete an accessible workspace firstly":"",
	"Done. CodeGen will exit to apply this changes":""
}