{
	"To improve the abilities of data isolation and lightweight runtime, as you can see, we upgraded its launch logic from installation package to the portable software since 1.3.0.":"为了提高数据隔离和轻量级运行的能力，如你所见，我们从1.3.0开始将其启动逻辑从安装包升级为可移植软件。",
	"In addition, we want to clarify some requests we will send in case you might wanna know.":"此外，我们想澄清一些我们将发送的请求，以防您想知道。",
	"How to rollback to the previous version?":"如何回滚到以前的版本？",
	"Official Websites":"官方网站",
	"How to import my previous data?":"如何导入我以前的数据？",
	"No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. ":"不，您可以通过按F12键打开您的开发工具，以审核CodeGen是否会发送意外请求。",
	"Control Panel":"控制面板",
	"Dear User":"尊敬的用户",
	"Shutdown Service":"关闭服务",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释并审计其漏洞，我们会在适当的时候发布它。",
	"How to update to the latest version for CodeGen ToolBox?":"如何更新到CodeGen工具箱的最新版本？",
	"QQ Chat Group":"QQ聊天群",
	"If you downloaded a ":"如果您下载了",
	"For instance, you can move {0} to {1}, that folder is your data folder.":"例如，您可以将{0}移动到{1}，该文件夹就是您的数据文件夹。",
	"Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support it.":"事实上，CodeGen服务不会局限于某些特定的平台。只要您的平台支持JRE和Node.js，CodeGen工具箱就总是能够支持它。",
	"If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support it as soon as possible.":"如果您真的希望CodeGen工具箱能够支持32位或其他操作系统(如FreeBSD)，请在Github Repository上提出问题，您的建议非常宝贵，我们将尽快提供支持。",
	"Settings":"设置",
	"To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it":"下载CodeGen工具箱，请先参考我们的官网{0}。你会看到有几个选项可以选择来下载它",
	"Firstly, please find a config file inside the CodeGen root folder":"首先，请在CodeGen根文件夹中找到一个配置文件",
	"If you are using Linux operation system, please click {0} to start.":"如果您使用的是Linux操作系统，请点击{0}开始。",
	"We already released its client source code on Github, learn more please refer to the following links.":"我们已经在Github上发布了它的客户端源代码，了解更多信息请参考以下链接。",
	"Restart CodeGen Service manually, so far, you have reinstated to the previous version.":"手动重新启动CodeGen服务，到目前为止，您已经恢复到以前的版本。",
	"Meanwhile, you can use JDK instead of JRE if you like":"同时，如果您愿意，您可以使用JDK而不是JRE",
	"How to import/Export my data?":"如何导入/导出我的数据？",
	"By modifying that configuration file, you can achieve the following goals with ease:":"通过修改该配置文件，您可以轻松实现以下目标：",
	"CodeGen is aiming to improve developer’s efficiency and save time as much as it can":"CodeGen的目标是尽可能地提高开发人员的效率和节省时间",
	"If you find any unavailability while using CodeGen in the off-line environment, please kindly inform us and we will check it asap.":"如果您在离线环境中使用CodeGen时发现任何不可用的情况，请通知我们，我们将尽快进行检查。",
	"If you are using MacOS/Linux operation system, please click {0} to start.":"如果您使用的是MacOS/Linux操作系统，请点击{0}开始。",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version and needn't to download two versions at the same time.":"预览版内部没有未知漏洞或不可用的潜在问题，您可以下载预览版，不需要同时下载两个版本。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platform as we can, there're platform listings as below we already supported":"根据开发者平台的使用情况，我们不支持32位，因为它太老了，不能运行。别担心，请放心，我们会尽我们所能支持更多的流行平台，下面是我们已经支持的平台列表",
	"CodeGen will NEVER use the device to launch any kind of attack or abuse.":"CodeGen永远不会使用该设备发动任何形式的攻击或滥用。",
	"If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support extra platforms as soon as possible.":"如果您真的希望CodeGen工具箱能够支持32位或其他操作系统(如FreeBSD)，请在Github Repository上提出问题，您的建议非常宝贵，我们会尽快支持额外的平台。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释，并将在适当的时候发布。",
	"If you want to use latest version of CodeGen ToolBox, please use preview version.":"如果您想使用最新版本的CodeGen工具箱，请使用预览版。",
	"To Be Continued":"未完待续",
	"To download CodeGen ToolBox, please access our official website {0} at first. You will see there're several options can be chose to download it.":"要下载CodeGen工具箱，请先访问我们的官网{0}。你会看到有几个选项可以选择来下载它。",
	"Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only. ":"请注意，预览版和发布版之间没有显著差异，预览版只是获得了比发布版更多的最新功能。",
	"Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我们将启动一个模式窗口来打印最新的程序输出。很抱歉没有集成的功能可以使用，我们将在后续版本中添加隐藏窗口功能，届时您可以在后台线程中享受CodeGen工具箱服务。",
	"Currently, we will launch a modal window to print latest program output. No worries, We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我们将启动一个模式窗口来打印最新的程序输出。不用担心，我们将在后续版本中添加隐藏窗口功能，届时您可以在后台线程中享受CodeGen工具箱服务。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在对它的源代码添加必要的注释和易受攻击的检查，并将在适当的时候发布。",
	"If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您对CodeGen工具箱有任何疑问，请参考下面的联系信息：",
	"Dear User,":"亲爱的用户，",
	"Secondly, edit it via any editor and change its version value":"其次，通过任何编辑器对其进行编辑并更改其版本值",
	"For instance, you can move codegen-v1.x.x-darwin-arm64/workspaces to codegen-v1.5.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以将codegen-v1.x.x-darwin-arm64/workspace移动到codegen-v1.5.x-darwin-arm64/workspace，该文件夹就是您的数据文件夹。",
	"There are multiple language versions that you can choose, please kindly refer to the links as below:":"有多种语言版本可供选择，请参考以下链接：",
	"How many platforms will ":"有多少平台将",
	"Sure! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"好的!当然，你可以在没有互联网的情况下使用CodeGen工具箱。除了一些功能可能需要您的互联网环境，其他功能将可用，即使您的电脑无法连接到互联网。",
	"If you really want this window to hide itself right now, we truly sorry there' no integrated functions can be used, but you can write some script if you know how to hide it. ":"如果你真的想现在隐藏这个窗口，我们很抱歉没有集成的函数可以使用，但如果你知道如何隐藏它，你可以写一些脚本。",
	"If you encountered an error while upgrade to the latest version, it's probably caused by some incompatible logic of old version or network issue, we're truly sorry to bring inconvenient to you. But there's still available to use latest version and keep using your previous data.":"如果您在升级到最新版本时遇到错误，可能是旧版本逻辑不兼容或网络问题造成的，给您带来不便，我们深表歉意。但仍然可以使用最新版本并继续使用您以前的数据。",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/workspaces to codegen-v1.4.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以将codegen-v1.3.x-darwin-arm64/workspace移动到codegen-v1.4.x-darwin-arm64/workspace，该文件夹就是您的数据文件夹。",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version directly and needn't to download two versions at the same time.":"预览版内部没有未知漏洞或不可用的潜在问题，可直接下载预览版，无需同时下载两个版本。",
	"Released Version":"已发布版本",
	"You can create a system service on Windows, and specify its bat script as startup.bat.":"您可以在Windows上创建系统服务，并将其BAT脚本指定为Startup.bat。",
	"For instance, you can move {0} to \"codegen-v1.3.x-darwin-arm64/workspaces\", that folder is your data folder.":"例如，您可以将{0}移动到“codegen-v1.3.x-darwin-arm64/workspace”，该文件夹就是您的数据文件夹。",
	"By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JDK runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"默认情况下，我们已经提供了JRE 1.8作为CodeGen的默认环境。如果您切换到更高或更低的JDK运行时，我们不能保证该版本将与这些编写的逻辑代码和相关依赖项完全兼容，尽管我们认为它可能是可行的。",
	"Rollback via UI page":"通过UI页面回滚",
	"We will never infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我们绝不会侵犯用户的隐私和利益，我们认为隐私高于一切，同时，为了实现这一承诺，我们在此向您保证以下事项，但不限于以下事项：",
	"Rollback via editing config file":"通过编辑配置文件回滚",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/{0} to codegen-v1.4.x-darwin-arm64/{0}, that folder is your data folder.":"例如，您可以将codegen-v1.3.x-darwin-arm64/{0}移动到codegen-v1.4.x-darwin-arm64/{0}，该文件夹就是您的数据文件夹。",
	"Guarantee for CodeGen Users":"为CodeGen用户提供保障",
	"It means you can carry all of these procedures and user data in the same folder everywhere every time, it's portable now!":"这意味着你每次都可以随身携带所有这些程序和用户数据在同一文件夹中，现在它是可移植的！",
	"How to shutdown CodeGen service?":"如何关闭CodeGen服务？",
	"specifying the app release version":"指定应用程序发布版本",
	"At the same time, we want to explain some requests we will send in case you maybe will get confused.":"同时，我们想解释一下我们将发送的一些请求，以防您感到困惑。",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/workspaces to codegen-v1.3.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以将codegen-v1.3.x-darwin-arm64/workspace移动到codegen-v1.3.x-darwin-arm64/workspace，该文件夹就是您的数据文件夹。",
	"Differences between released version and preview version:":"发布版本和预览版本的区别：",
	"CodeGen Docs":"代码生成文档",
	"Release Version":"发布版本",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释和审计漏洞，并将在适当的时候发布。",
	"Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"对不起，这份文件到目前为止还没有写完。我们会尽快出版的。",
	"There's no latent issue or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"预览版内部没有潜在问题或不可用，您不必同时下载预览版和发行版。",
	"Is there more configuration I can adjust for CodeGen Toolbox?":"是否有更多配置可以针对CodeGen工具箱进行调整？",
	"Official Website":"官方网站",
	"If you want to use stable version of CodeGen ToolBox, please use released version.":"如果您想使用稳定版本的CodeGen工具箱，请使用发布版本。",
	"specifying the app access token (Too often, it's no need to modify since CodeGen will generate its token automatcially)":"指定应用程序访问令牌(通常不需要修改，因为CodeGen会自动生成其令牌)",
	"Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add the hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我们将启动一个模式窗口来打印最新的程序输出。很抱歉没有集成的功能可以使用，我们将在后续版本中添加隐藏窗口功能，届时您可以在后台线程中享受CodeGen工具箱服务。",
	"You can use nohup or {0} to run CodeGen service in the background":"您可以使用nohup或{0}在后台运行CodeGen服务",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"预览版内部没有未知漏洞或不可用的潜在问题，无需同时下载预览版和发行版。",
	"Can I use CodeGen ToolBox without Internet?":"我可以在没有互联网的情况下使用CodeGen工具箱吗？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释并审计它的漏洞，我们会在适当的时候公布它的所有源代码。",
	"specifying the listen port":"指定侦听端口",
	"Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端服务源代码，对于服务器端，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"How to Contact Developer?":"如何联系开发商？",
	"In general, you will receive an update notification message while using software once we published a new version of CodeGen ToolBox. Just follow the steps and upgrade to the latest version.":"通常，一旦我们发布了新版本的CodeGen工具箱，您将在使用软件时收到更新通知消息。只需按照步骤操作并升级到最新版本即可。",
	"Will CodeGen send unexpected requests with carrying my private data?":"CodeGen会携带我的私有数据发送意外请求吗？",
	"Is CodeGen ToolBox an Open-Source Software?":"CodeGen工具箱是开源软件吗？",
	"Can I run CodeGen service without a modal window?":"我可以在没有模式窗口的情况下运行CodeGen服务吗？",
	"Preview Version":"预览版",
	"Can I replaced the integrated JRE with my favourite one?":"我可以用我最喜欢的JRE替换集成的JRE吗？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释和检查漏洞，并将在适当的时候发布。",
	"Friendly reminder, please DO NOT download or upgrade CodeGen from any untrusted websites, it may bring unexpected latent risks to you, such as viruses, ADs, information leakages, etc.":"友好提醒，请不要从任何不可信的网站下载或升级CodeGen，它可能会给您带来意想不到的潜在风险，如病毒、广告、信息泄露等。",
	"In general, you will see a black modal window after executing the script. ":"通常，在执行该脚本后，您将看到一个黑色的模式窗口。",
	"All Mac OS M1 Versions":"所有Mac OS M1版本",
	"The paragraph below will present how to start and stop CodeGen ToolBox step by step.":"下面的段落将逐步介绍如何启动和停止CodeGen工具箱。",
	"Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"到目前为止，开发者还在完善相关的贡献文档和开发工具。如果您想了解CodeGen工具箱的基本信息，您可以先阅读我们的开源资源库，然后如果您有任何问题，可以随时联系我们。",
	"If you are using Windows operation system, please click {0} to start.":"如果您使用的是Windows操作系统，请点击{0}开始。",
	"Yes, we already provided the system boot configuration for you, it's named \"system_boot.properties\" and is located in the config folder.":"是的，我们已经为您提供了系统引导配置，它名为“system_boot.properties”，位于配置文件夹中。",
	"CodeGen will NEVER analyze or upload your files on this PC":"CodeGen永远不会在这台电脑上分析或上传您的文件",
	"Without the user’s definite permission, CodeGen will NEVER read/write your files or execute any unexpected operation.":"没有用户的明确许可，CodeGen将永远不会读/写您的文件或执行任何意外操作。",
	"Thank you for downloading CodeGen ToolBox! We would like to introduce its functions and common questions for you in the following chapters.":"感谢您下载CodeGen工具箱！在接下来的章节中，我们将为您介绍它的功能和常见问题。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're platform listings as below we already supported":"根据开发者平台的使用情况，我们不支持32位，因为它太老了，不能运行。别担心，请放心，我们会尽我们所能支持更多的流行平台，下面是我们已经支持的平台列表",
	"If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您对CodeGen工具箱有任何疑问，请参考下面的联系信息：",
	"More options will be appended ASAP, please kindly stay tuned.":"更多选项将尽快添加，敬请关注。",
	"Definitely, you can do that.":"当然，你可以做到的。",
	"Github Repository":"GitHub存储库",
	"By the way, we want to explain some requests we will send in case you maybe will get confused.":"顺便说一句，我们想解释一下我们将发送的一些请求，以防您感到困惑。",
	"verify if current verrsion is available to use":"验证当前版本是否可供使用",
	"All Linux Distributions":"所有Linux发行版",
	"Factually, there's another way to shut down CodeGen service with ease, please refer to the screenshot below: ":"事实上，还有另一种方式可以轻松关闭CodeGen服务，请参考下面的截图：",
	"Last but not least, since CodeGen is still under the Beta version. If you encountered any kind of errors that you cannot handle, or you may have any suggestions for the next features of CodeGen, please send an E-Mail or just create an issue on the Github repository, we would be honored if you would like to help us to improve the software.":"最后但并非最不重要的一点是，因为CodeGen仍处于Beta版本之下。如果您遇到任何无法处理的错误，或者您对CodeGen的下一功能有任何建议，请发送电子邮件或只是在Github存储库上创建问题，如果您愿意帮助我们改进软件，我们将不胜感激。",
	"Introduction":"引言",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. Please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"根据开发者平台的使用情况，我们不支持32位，因为它太老了，不能运行。请放心，我们将支持尽可能多的平台，我们已经支持的平台列表如下",
	"Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们公布了它的客户端服务源代码，关于服务器端，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"The guarantee for CodeGen Users":"对CodeGen用户的保障",
	"There's no latent vulnerability or unavailability issue inside preview version, you don't have to download preview and releasel version at the same time.":"预览版中没有潜在的漏洞或不可用问题，您不必同时下载预览版和发行版。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"Just simply close that dialog, then CodeGen will exit automatically. For more approaches that shutdown the CodeGen service expediently, we will consider proper solutions and upgrade its related logic in the following versions if possible.":"只需关闭该对话框，CodeGen就会自动退出。对于更多方便关闭CodeGen服务的方法，我们将考虑合适的解决方案，并在可能的情况下在后续版本中升级其相关逻辑。",
	"To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it.":"下载CodeGen工具箱，请先参考我们的官网{0}。你会看到有几个选项可以选择来下载它。",
	"CodeGen ToolBox":"CodeGen工具箱",
	"How to Download CodeGen":"如何下载CodeGen",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're a platform listings as below we already supported":"根据开发者平台的使用情况，我们不支持32位，因为它太老了，不能运行。别担心，请放心，我们会尽我们所能支持更多的流行平台，下面是我们已经支持的平台列表",
	"For instance, you can move codegen-v1.4.x-darwin-arm64/workspaces to codegen-v1.5.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以将codegen-v1.4.x-darwin-arm64/workspace移动到codegen-v1.5.x-darwin-arm64/workspace，该文件夹就是您的数据文件夹。",
	"CodeGen is offline-able software, which means you can use it as well without the Internet.":"CodeGen是可以脱机使用的软件，这意味着你可以在没有互联网的情况下使用它。",
	"Thanks and Regards":"感谢和问候",
	"How many platforms will CodeGen service supports? ":"CodeGen服务将支持多少个平台？",
	"How to import my previous data in a brand CodeGen software?":"如何在品牌CodeGen软件中导入我以前的数据？",
	"Contact Developer":"联系开发人员",
	"How to ":"如何",
	"How to upgrade to the latest version for CodeGen ToolBox?":"如何升级到CodeGen工具箱的最新版本？",
	"Can I replaced the integrated JDK with my favourite one?":"我可以用我最喜欢的JDK替换集成的JDK吗？",
	"verify if current route page is available to use":"验证当前路径页面是否可用",
	"The guarantee for our users":"为我们的用户提供保证",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释，并对其源代码的漏洞进行审计，并将在适当的时候发布。",
	"Currently, we will launch a modal window to print latest program output. We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我们将启动一个模式窗口来打印最新的程序输出。我们将在以下版本中添加隐藏窗口功能，届时您可以在后台线程中享受CodeGen工具箱服务。",
	"Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support running over it.":"事实上，CodeGen服务不会局限于某些特定的平台。只要您的平台支持JRE和Node.js，CodeGen工具箱总是能够支持在其上运行。",
	"By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JRE runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"默认情况下，我们已经提供了JRE 1.8作为CodeGen的默认环境。如果您切换到更高或更低的JRE运行时，我们不能保证该版本将与这些编写的逻辑代码和相关依赖项完全兼容，尽管我们认为它可能是可行的。",
	"Just a friendly reminder, you should restart CodeGen service manually after having installed the latest version.":"只是一个友好的提醒，您应该在安装了最新版本后手动重新启动CodeGen服务。",
	"Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only.":"请注意，预览版和发布版之间没有显著差异，预览版只是获得了比发布版更多的最新功能。",
	"How to start CodeGen service?":"如何启动CodeGen服务？",
	"No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. But we want to ":"不，您可以通过按F12键打开您的开发工具，以审核CodeGen是否会发送意外请求。但我们想要",
	"Yes! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"是!当然，你可以在没有互联网的情况下使用CodeGen工具箱。除了一些功能可能需要您的互联网环境，其他功能将可用，即使您的电脑无法连接到互联网。",
	"All Mac OS Intel Versions":"所有Mac OS Intel版本",
	"You can find a rollback button in the update UI page, just simply click it and then you can switch it to the previous version.":"您可以在更新UI页面中找到一个回滚按钮，只需单击它，然后您就可以将其切换到以前的版本。",
	"We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我们永远不会永远侵犯用户的隐私和利益，我们认为隐私高于一切，同时，为了实现这一承诺，我们在此向您保证以下事项，但不限于以下事项：",
	"For instance, you can move {0} to codegen-v1.3.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以将{0}移动到codegen-v1.3.x-darwin-arm64/workspace，该文件夹就是您的数据文件夹。",
	"How to Contribute CodeGen ToolBox?":"如何贡献CodeGen工具箱？",
	"Download CodeGen":"下载CodeGen",
	"If you really want this window to hide itself right now, you can write some script if you know how to hide it. ":"如果你真的想让这个窗口立刻隐藏起来，你可以编写一些脚本，如果你知道如何隐藏它的话。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"根据开发者平台的使用情况，我们不支持32位，因为它太老了，不能运行。别担心，请放心，我们会尽我们所能支持更多的平台，下面是我们已经支持的平台列表",
	"You can find {0} directory in the root level of your old CodeGen software, then you can copy that folder to the corresponding folder of new CodeGen ToolBox. ":"您可以在旧CodeGen软件的根目录中找到{0}目录，然后可以将该文件夹复制到新CodeGen工具箱的相应文件夹中。",
	"If you are using MacOS operation system, please click {0} to start.":"如果您使用的是MacOS操作系统，请点击{0}开始。",
	"Before starting CodeGen, please read this page at first.":"在启动CodeGen之前，请先阅读此页面。",
	"We will never ever forever infringe upon user's privacy and interests as bold as brass, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我们永远不会像黄铜一样肆无忌惮地侵犯用户的隐私和利益，我们认为隐私高于一切，同时，为了实现这一承诺，我们在此向您保证以下事项，但不限于以下事项：",
	"Shutdown CodeGen service on UI Page":"关闭用户界面页面上的CodeGen服务"
}