{
	"To improve the abilities of data isolation and lightweight runtime, as you can see, we upgraded its launch logic from installation package to the portable software since 1.3.0.":"爲了提高數據隔離和輕量級運行的能力，如你所見，我們從1.3.0開始將其啓動邏輯從安裝包升級爲可移植軟件。",
	"In addition, we want to clarify some requests we will send in case you might wanna know.":"此外，我們想澄清一些我們將發送的請求，以防您想知道。",
	"How to rollback to the previous version?":"如何回滾到以前的版本？",
	"Official Websites":"官方網站",
	"How to import my previous data?":"如何導入我以前的數據？",
	"No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. ":"不，您可以通過按F12鍵打開您的開發工具，以審覈CodeGen是否會發送意外請求。",
	"Control Panel":"控制面板",
	"Dear User":"尊敬的用戶",
	"Shutdown Service":"關閉服務",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋並審計其漏洞，我們會在適當的時候發佈它。",
	"How to update to the latest version for CodeGen ToolBox?":"如何更新到CodeGen工具箱的最新版本？",
	"QQ Chat Group":"QQ聊天羣",
	"If you downloaded a ":"如果您下載了",
	"For instance, you can move {0} to {1}, that folder is your data folder.":"例如，您可以將{0}移動到{1}，該文件夾就是您的數據文件夾。",
	"Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support it.":"事實上，CodeGen服務不會侷限於某些特定的平臺。只要您的平臺支持JRE和Node.js，CodeGen工具箱就總是能夠支持它。",
	"If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support it as soon as possible.":"如果您真的希望CodeGen工具箱能夠支持32位或其他操作系統(如FreeBSD)，請在Github Repository上提出問題，您的建議非常寶貴，我們將儘快提供支持。",
	"Settings":"設置",
	"To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it":"下載CodeGen工具箱，請先參考我們的官網{0}。你會看到有幾個選項可以選擇來下載它",
	"Firstly, please find a config file inside the CodeGen root folder":"首先，請在CodeGen根文件夾中找到一個配置文件",
	"If you are using Linux operation system, please click {0} to start.":"如果您使用的是Linux操作系統，請點擊{0}開始。",
	"We already released its client source code on Github, learn more please refer to the following links.":"我們已經在Github上發佈了它的客戶端源代碼，瞭解更多信息請參考以下鏈接。",
	"Restart CodeGen Service manually, so far, you have reinstated to the previous version.":"手動重新啓動CodeGen服務，到目前爲止，您已經恢復到以前的版本。",
	"Meanwhile, you can use JDK instead of JRE if you like":"同時，如果您願意，您可以使用JDK而不是JRE",
	"How to import/Export my data?":"如何導入/導出我的數據？",
	"By modifying that configuration file, you can achieve the following goals with ease:":"通過修改該配置文件，您可以輕鬆實現以下目標：",
	"CodeGen is aiming to improve developer’s efficiency and save time as much as it can":"CodeGen的目標是儘可能地提高開發人員的效率和節省時間",
	"If you find any unavailability while using CodeGen in the off-line environment, please kindly inform us and we will check it asap.":"如果您在離線環境中使用CodeGen時發現任何不可用的情況，請通知我們，我們將儘快進行檢查。",
	"If you are using MacOS/Linux operation system, please click {0} to start.":"如果您使用的是MacOS/Linux操作系統，請點擊{0}開始。",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version and needn't to download two versions at the same time.":"預覽版內部沒有未知漏洞或不可用的潛在問題，您可以下載預覽版，不需要同時下載兩個版本。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platform as we can, there're platform listings as below we already supported":"根據開發者平臺的使用情況，我們不支持32位，因爲它太老了，不能運行。別擔心，請放心，我們會盡我們所能支持更多的流行平臺，下面是我們已經支持的平臺列表",
	"CodeGen will NEVER use the device to launch any kind of attack or abuse.":"CodeGen永遠不會使用該設備發動任何形式的攻擊或濫用。",
	"If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support extra platforms as soon as possible.":"如果您真的希望CodeGen工具箱能夠支持32位或其他操作系統(如FreeBSD)，請在Github Repository上提出問題，您的建議非常寶貴，我們會儘快支持額外的平臺。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"If you want to use latest version of CodeGen ToolBox, please use preview version.":"如果您想使用最新版本的CodeGen工具箱，請使用預覽版。",
	"To Be Continued":"未完待續",
	"To download CodeGen ToolBox, please access our official website {0} at first. You will see there're several options can be chose to download it.":"要下載CodeGen工具箱，請先訪問我們的官網{0}。你會看到有幾個選項可以選擇來下載它。",
	"Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only. ":"請注意，預覽版和發佈版之間沒有顯著差異，預覽版只是獲得了比發佈版更多的最新功能。",
	"Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我們將啓動一個模式窗口來打印最新的程序輸出。很抱歉沒有集成的功能可以使用，我們將在後續版本中添加隱藏窗口功能，屆時您可以在後臺線程中享受CodeGen工具箱服務。",
	"Currently, we will launch a modal window to print latest program output. No worries, We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我們將啓動一個模式窗口來打印最新的程序輸出。不用擔心，我們將在後續版本中添加隱藏窗口功能，屆時您可以在後臺線程中享受CodeGen工具箱服務。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在對它的源代碼添加必要的註釋和易受攻擊的檢查，並將在適當的時候發佈。",
	"If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您對CodeGen工具箱有任何疑問，請參考下面的聯繫信息：",
	"Dear User,":"親愛的用戶，",
	"Secondly, edit it via any editor and change its version value":"其次，通過任何編輯器對其進行編輯並更改其版本值",
	"For instance, you can move codegen-v1.x.x-darwin-arm64/workspaces to codegen-v1.5.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以將codegen-v1.x.x-darwin-arm64/workspace移動到codegen-v1.5.x-darwin-arm64/workspace，該文件夾就是您的數據文件夾。",
	"There are multiple language versions that you can choose, please kindly refer to the links as below:":"有多種語言版本可供選擇，請參考以下鏈接：",
	"How many platforms will ":"有多少平臺將",
	"Sure! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"好的!當然，你可以在沒有互聯網的情況下使用CodeGen工具箱。除了一些功能可能需要您的互聯網環境，其他功能將可用，即使您的電腦無法連接到互聯網。",
	"If you really want this window to hide itself right now, we truly sorry there' no integrated functions can be used, but you can write some script if you know how to hide it. ":"如果你真的想現在隱藏這個窗口，我們很抱歉沒有集成的函數可以使用，但如果你知道如何隱藏它，你可以寫一些腳本。",
	"If you encountered an error while upgrade to the latest version, it's probably caused by some incompatible logic of old version or network issue, we're truly sorry to bring inconvenient to you. But there's still available to use latest version and keep using your previous data.":"如果您在升級到最新版本時遇到錯誤，可能是舊版本邏輯不兼容或網絡問題造成的，給您帶來不便，我們深表歉意。但仍然可以使用最新版本並繼續使用您以前的數據。",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/workspaces to codegen-v1.4.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以將codegen-v1.3.x-darwin-arm64/workspace移動到codegen-v1.4.x-darwin-arm64/workspace，該文件夾就是您的數據文件夾。",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version directly and needn't to download two versions at the same time.":"預覽版內部沒有未知漏洞或不可用的潛在問題，可直接下載預覽版，無需同時下載兩個版本。",
	"Released Version":"已發佈版本",
	"You can create a system service on Windows, and specify its bat script as startup.bat.":"您可以在Windows上創建系統服務，並將其BAT腳本指定爲Startup.bat。",
	"For instance, you can move {0} to \"codegen-v1.3.x-darwin-arm64/workspaces\", that folder is your data folder.":"例如，您可以將{0}移動到“codegen-v1.3.x-darwin-arm64/workspace”，該文件夾就是您的數據文件夾。",
	"By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JDK runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"默認情況下，我們已經提供了JRE 1.8作爲CodeGen的默認環境。如果您切換到更高或更低的JDK運行時，我們不能保證該版本將與這些編寫的邏輯代碼和相關依賴項完全兼容，儘管我們認爲它可能是可行的。",
	"Rollback via UI page":"通過UI頁面回滾",
	"We will never infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我們絕不會侵犯用戶的隱私和利益，我們認爲隱私高於一切，同時，爲了實現這一承諾，我們在此向您保證以下事項，但不限於以下事項：",
	"Rollback via editing config file":"通過編輯配置文件回滾",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/{0} to codegen-v1.4.x-darwin-arm64/{0}, that folder is your data folder.":"例如，您可以將codegen-v1.3.x-darwin-arm64/{0}移動到codegen-v1.4.x-darwin-arm64/{0}，該文件夾就是您的數據文件夾。",
	"Guarantee for CodeGen Users":"爲CodeGen用戶提供保障",
	"It means you can carry all of these procedures and user data in the same folder everywhere every time, it's portable now!":"這意味着你每次都可以隨身攜帶所有這些程序和用戶數據在同一文件夾中，現在它是可移植的！",
	"How to shutdown CodeGen service?":"如何關閉CodeGen服務？",
	"specifying the app release version":"指定應用程序發佈版本",
	"At the same time, we want to explain some requests we will send in case you maybe will get confused.":"同時，我們想解釋一下我們將發送的一些請求，以防您感到困惑。",
	"For instance, you can move codegen-v1.3.x-darwin-arm64/workspaces to codegen-v1.3.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以將codegen-v1.3.x-darwin-arm64/workspace移動到codegen-v1.3.x-darwin-arm64/workspace，該文件夾就是您的數據文件夾。",
	"Differences between released version and preview version:":"發佈版本和預覽版本的區別：",
	"CodeGen Docs":"代碼生成文檔",
	"Release Version":"發佈版本",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋和審計漏洞，並將在適當的時候發佈。",
	"Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"對不起，這份文件到目前爲止還沒有寫完。我們會儘快出版的。",
	"There's no latent issue or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"預覽版內部沒有潛在問題或不可用，您不必同時下載預覽版和發行版。",
	"Is there more configuration I can adjust for CodeGen Toolbox?":"是否有更多配置可以針對CodeGen工具箱進行調整？",
	"Official Website":"官方網站",
	"If you want to use stable version of CodeGen ToolBox, please use released version.":"如果您想使用穩定版本的CodeGen工具箱，請使用發佈版本。",
	"specifying the app access token (Too often, it's no need to modify since CodeGen will generate its token automatcially)":"指定應用程序訪問令牌(通常不需要修改，因爲CodeGen會自動生成其令牌)",
	"Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add the hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我們將啓動一個模式窗口來打印最新的程序輸出。很抱歉沒有集成的功能可以使用，我們將在後續版本中添加隱藏窗口功能，屆時您可以在後臺線程中享受CodeGen工具箱服務。",
	"You can use nohup or {0} to run CodeGen service in the background":"您可以使用nohup或{0}在後臺運行CodeGen服務",
	"There's no latent issues of unknown vulnerability or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"預覽版內部沒有未知漏洞或不可用的潛在問題，無需同時下載預覽版和發行版。",
	"Can I use CodeGen ToolBox without Internet?":"我可以在沒有互聯網的情況下使用CodeGen工具箱嗎？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋並審計它的漏洞，我們會在適當的時候公佈它的所有源代碼。",
	"specifying the listen port":"指定偵聽端口",
	"Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端服務源代碼，對於服務器端，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"How to Contact Developer?":"如何聯繫開發商？",
	"In general, you will receive an update notification message while using software once we published a new version of CodeGen ToolBox. Just follow the steps and upgrade to the latest version.":"通常，一旦我們發佈了新版本的CodeGen工具箱，您將在使用軟件時收到更新通知消息。只需按照步驟操作並升級到最新版本即可。",
	"Will CodeGen send unexpected requests with carrying my private data?":"CodeGen會攜帶我的私有數據發送意外請求嗎？",
	"Is CodeGen ToolBox an Open-Source Software?":"CodeGen工具箱是開源軟件嗎？",
	"Can I run CodeGen service without a modal window?":"我可以在沒有模式窗口的情況下運行CodeGen服務嗎？",
	"Preview Version":"預覽版",
	"Can I replaced the integrated JRE with my favourite one?":"我可以用我最喜歡的JRE替換集成的JRE嗎？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋和檢查漏洞，並將在適當的時候發佈。",
	"Friendly reminder, please DO NOT download or upgrade CodeGen from any untrusted websites, it may bring unexpected latent risks to you, such as viruses, ADs, information leakages, etc.":"友好提醒，請不要從任何不可信的網站下載或升級CodeGen，它可能會給您帶來意想不到的潛在風險，如病毒、廣告、信息泄露等。",
	"In general, you will see a black modal window after executing the script. ":"通常，在執行該腳本後，您將看到一個黑色的模式窗口。",
	"All Mac OS M1 Versions":"所有Mac OS M1版本",
	"The paragraph below will present how to start and stop CodeGen ToolBox step by step.":"下面的段落將逐步介紹如何啓動和停止CodeGen工具箱。",
	"Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"到目前爲止，開發者還在完善相關的貢獻文檔和開發工具。如果您想瞭解CodeGen工具箱的基本信息，您可以先閱讀我們的開源資源庫，然後如果您有任何問題，可以隨時聯繫我們。",
	"If you are using Windows operation system, please click {0} to start.":"如果您使用的是Windows操作系統，請點擊{0}開始。",
	"Yes, we already provided the system boot configuration for you, it's named \"system_boot.properties\" and is located in the config folder.":"是的，我們已經爲您提供了系統引導配置，它名爲“system_boot.properties”，位於配置文件夾中。",
	"CodeGen will NEVER analyze or upload your files on this PC":"CodeGen永遠不會在這臺電腦上分析或上傳您的文件",
	"Without the user’s definite permission, CodeGen will NEVER read/write your files or execute any unexpected operation.":"沒有用戶的明確許可，CodeGen將永遠不會讀/寫您的文件或執行任何意外操作。",
	"Thank you for downloading CodeGen ToolBox! We would like to introduce its functions and common questions for you in the following chapters.":"感謝您下載CodeGen工具箱！在接下來的章節中，我們將爲您介紹它的功能和常見問題。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're platform listings as below we already supported":"根據開發者平臺的使用情況，我們不支持32位，因爲它太老了，不能運行。別擔心，請放心，我們會盡我們所能支持更多的流行平臺，下面是我們已經支持的平臺列表",
	"If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您對CodeGen工具箱有任何疑問，請參考下面的聯繫信息：",
	"More options will be appended ASAP, please kindly stay tuned.":"更多選項將儘快添加，敬請關注。",
	"Definitely, you can do that.":"當然，你可以做到的。",
	"Github Repository":"GitHub存儲庫",
	"By the way, we want to explain some requests we will send in case you maybe will get confused.":"順便說一句，我們想解釋一下我們將發送的一些請求，以防您感到困惑。",
	"verify if current verrsion is available to use":"驗證當前版本是否可供使用",
	"All Linux Distributions":"所有Linux發行版",
	"Factually, there's another way to shut down CodeGen service with ease, please refer to the screenshot below: ":"事實上，還有另一種方式可以輕鬆關閉CodeGen服務，請參考下面的截圖：",
	"Last but not least, since CodeGen is still under the Beta version. If you encountered any kind of errors that you cannot handle, or you may have any suggestions for the next features of CodeGen, please send an E-Mail or just create an issue on the Github repository, we would be honored if you would like to help us to improve the software.":"最後但並非最不重要的一點是，因爲CodeGen仍處於Beta版本之下。如果您遇到任何無法處理的錯誤，或者您對CodeGen的下一功能有任何建議，請發送電子郵件或只是在Github存儲庫上創建問題，如果您願意幫助我們改進軟件，我們將不勝感激。",
	"Introduction":"引言",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. Please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"根據開發者平臺的使用情況，我們不支持32位，因爲它太老了，不能運行。請放心，我們將支持儘可能多的平臺，我們已經支持的平臺列表如下",
	"Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們公佈了它的客戶端服務源代碼，關於服務器端，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"The guarantee for CodeGen Users":"對CodeGen用戶的保障",
	"There's no latent vulnerability or unavailability issue inside preview version, you don't have to download preview and releasel version at the same time.":"預覽版中沒有潛在的漏洞或不可用問題，您不必同時下載預覽版和發行版。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"Just simply close that dialog, then CodeGen will exit automatically. For more approaches that shutdown the CodeGen service expediently, we will consider proper solutions and upgrade its related logic in the following versions if possible.":"只需關閉該對話框，CodeGen就會自動退出。對於更多方便關閉CodeGen服務的方法，我們將考慮合適的解決方案，並在可能的情況下在後續版本中升級其相關邏輯。",
	"To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it.":"下載CodeGen工具箱，請先參考我們的官網{0}。你會看到有幾個選項可以選擇來下載它。",
	"CodeGen ToolBox":"CodeGen工具箱",
	"How to Download CodeGen":"如何下載CodeGen",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're a platform listings as below we already supported":"根據開發者平臺的使用情況，我們不支持32位，因爲它太老了，不能運行。別擔心，請放心，我們會盡我們所能支持更多的流行平臺，下面是我們已經支持的平臺列表",
	"For instance, you can move codegen-v1.4.x-darwin-arm64/workspaces to codegen-v1.5.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以將codegen-v1.4.x-darwin-arm64/workspace移動到codegen-v1.5.x-darwin-arm64/workspace，該文件夾就是您的數據文件夾。",
	"CodeGen is offline-able software, which means you can use it as well without the Internet.":"CodeGen是可以脫機使用的軟件，這意味着你可以在沒有互聯網的情況下使用它。",
	"Thanks and Regards":"感謝和問候",
	"How many platforms will CodeGen service supports? ":"CodeGen服務將支持多少個平臺？",
	"How to import my previous data in a brand CodeGen software?":"如何在品牌CodeGen軟件中導入我以前的數據？",
	"Contact Developer":"聯繫開發人員",
	"How to ":"如何",
	"How to upgrade to the latest version for CodeGen ToolBox?":"如何升級到CodeGen工具箱的最新版本？",
	"Can I replaced the integrated JDK with my favourite one?":"我可以用我最喜歡的JDK替換集成的JDK嗎？",
	"verify if current route page is available to use":"驗證當前路徑頁面是否可用",
	"The guarantee for our users":"爲我們的用戶提供保證",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋，並對其源代碼的漏洞進行審計，並將在適當的時候發佈。",
	"Currently, we will launch a modal window to print latest program output. We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"目前，我們將啓動一個模式窗口來打印最新的程序輸出。我們將在以下版本中添加隱藏窗口功能，屆時您可以在後臺線程中享受CodeGen工具箱服務。",
	"Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support running over it.":"事實上，CodeGen服務不會侷限於某些特定的平臺。只要您的平臺支持JRE和Node.js，CodeGen工具箱總是能夠支持在其上運行。",
	"By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JRE runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"默認情況下，我們已經提供了JRE 1.8作爲CodeGen的默認環境。如果您切換到更高或更低的JRE運行時，我們不能保證該版本將與這些編寫的邏輯代碼和相關依賴項完全兼容，儘管我們認爲它可能是可行的。",
	"Just a friendly reminder, you should restart CodeGen service manually after having installed the latest version.":"只是一個友好的提醒，您應該在安裝了最新版本後手動重新啓動CodeGen服務。",
	"Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only.":"請注意，預覽版和發佈版之間沒有顯著差異，預覽版只是獲得了比發佈版更多的最新功能。",
	"How to start CodeGen service?":"如何啓動CodeGen服務？",
	"No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. But we want to ":"不，您可以通過按F12鍵打開您的開發工具，以審覈CodeGen是否會發送意外請求。但我們想要",
	"Yes! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"是!當然，你可以在沒有互聯網的情況下使用CodeGen工具箱。除了一些功能可能需要您的互聯網環境，其他功能將可用，即使您的電腦無法連接到互聯網。",
	"All Mac OS Intel Versions":"所有Mac OS Intel版本",
	"You can find a rollback button in the update UI page, just simply click it and then you can switch it to the previous version.":"您可以在更新UI頁面中找到一個回滾按鈕，只需單擊它，然後您就可以將其切換到以前的版本。",
	"We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我們永遠不會永遠侵犯用戶的隱私和利益，我們認爲隱私高於一切，同時，爲了實現這一承諾，我們在此向您保證以下事項，但不限於以下事項：",
	"For instance, you can move {0} to codegen-v1.3.x-darwin-arm64/workspaces, that folder is your data folder.":"例如，您可以將{0}移動到codegen-v1.3.x-darwin-arm64/workspace，該文件夾就是您的數據文件夾。",
	"How to Contribute CodeGen ToolBox?":"如何貢獻CodeGen工具箱？",
	"Download CodeGen":"下載CodeGen",
	"If you really want this window to hide itself right now, you can write some script if you know how to hide it. ":"如果你真的想讓這個窗口立刻隱藏起來，你可以編寫一些腳本，如果你知道如何隱藏它的話。",
	"According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"根據開發者平臺的使用情況，我們不支持32位，因爲它太老了，不能運行。別擔心，請放心，我們會盡我們所能支持更多的平臺，下面是我們已經支持的平臺列表",
	"You can find {0} directory in the root level of your old CodeGen software, then you can copy that folder to the corresponding folder of new CodeGen ToolBox. ":"您可以在舊CodeGen軟件的根目錄中找到{0}目錄，然後可以將該文件夾復制到新CodeGen工具箱的相應文件夾中。",
	"If you are using MacOS operation system, please click {0} to start.":"如果您使用的是MacOS操作系統，請點擊{0}開始。",
	"Before starting CodeGen, please read this page at first.":"在啓動CodeGen之前，請先閱讀此頁面。",
	"We will never ever forever infringe upon user's privacy and interests as bold as brass, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"我們永遠不會像黃銅一樣肆無忌憚地侵犯用戶的隱私和利益，我們認爲隱私高於一切，同時，爲了實現這一承諾，我們在此向您保證以下事項，但不限於以下事項：",
	"Shutdown CodeGen service on UI Page":"關閉用戶界面頁面上的CodeGen服務"
}