{
	"To Be Continued":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"",
	"Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"",
	"If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"",
	"If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"",
	"Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"",
	"How to Contact Developer?":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"",
	"Is CodeGen ToolBox an Open-Source Software?":"",
	"QQ Chat Group":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"",
	"How to Contribute CodeGen ToolBox?":"",
	"Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"",
	"Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":""
}