{"To improve the abilities of data isolation and lightweight runtime, as you can see, we upgraded its launch logic from installation package to the portable software since 1.3.0.":"","In addition, we want to clarify some requests we will send in case you might wanna know.":"","How to rollback to the previous version?":"","Official Websites":"","No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. ":"","Control Panel":"","Dear User":"","Shutdown Service":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"","How to update to the latest version for CodeGen ToolBox?":"","QQ Chat Group":"","Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support it.":"","If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support it as soon as possible.":"","Settings":"","To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it":"","Firstly, please find a config file inside the CodeGen root folder":"","If you are using Linux operation system, please click {0} to start.":"","We already released its client source code on Github, learn more please refer to the following links.":"","Restart CodeGen Service manually, so far, you have reinstated to the previous version.":"","Meanwhile, you can use JDK instead of JRE if you like":"","By modifying that configuration file, you can achieve the following goals with ease:":"","CodeGen is aiming to improve developer’s efficiency and save time as much as it can":"","If you find any unavailability while using CodeGen in the off-line environment, please kindly inform us and we will check it asap.":"","If you are using MacOS/Linux operation system, please click {0} to start.":"","There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version and needn't to download two versions at the same time.":"","According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platform as we can, there're platform listings as below we already supported":"","CodeGen will NEVER use the device to launch any kind of attack or abuse.":"","If you really hope CodeGen ToolBox can support 32-bits or another OS (such as FreeBSD), please raise an issue on Github Repository, your suggestions are highly valued and we will support extra platforms as soon as possible.":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":"","If you want to use latest version of CodeGen ToolBox, please use preview version.":"","To Be Continued":"","To download CodeGen ToolBox, please access our official website {0} at first. You will see there're several options can be chose to download it.":"","Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only. ":"","Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"","Currently, we will launch a modal window to print latest program output. No worries, We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"","If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"","Dear User,":"","Secondly, edit it via any editor and change its version value":"","There are multiple language versions that you can choose, please kindly refer to the links as below:":"","How many platforms will ":"","Sure! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"","If you really want this window to hide itself right now, we truly sorry there' no integrated functions can be used, but you can write some script if you know how to hide it. ":"","There's no latent issues of unknown vulnerability or unavailability inside preview version, you can download preview version directly and needn't to download two versions at the same time.":"","Released Version":"","You can create a system service on Windows, and specify its bat script as startup.bat.":"","By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JDK runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"","Rollback via UI page":"","We will never infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"","Rollback via editing config file":"","Guarantee for CodeGen Users":"","It means you can carry all of these procedures and user data in the same folder everywhere every time, it's portable now!":"","How to shutdown CodeGen service?":"","specifying the app release version":"","At the same time, we want to explain some requests we will send in case you maybe will get confused.":"","Differences between released version and preview version:":"","CodeGen Docs":"","Release Version":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"","Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"","There's no latent issue or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"","Is there more configuration I can adjust for CodeGen Toolbox?":"","Official Website":"","If you want to use stable version of CodeGen ToolBox, please use released version.":"","specifying the app access token (Too often, it's no need to modify since CodeGen will generate its token automatcially)":"","Currently, we will launch a modal window to print latest program output. We truly sorry there' no integrated functions can be used, we will add the hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"","You can use nohup or {0} to run CodeGen service in the background":"","There's no latent issues of unknown vulnerability or unavailability inside preview version, you don't have to download preview and releasel version at the same time.":"","Can I use CodeGen ToolBox without Internet?":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"","specifying the listen port":"","Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"","How to Contact Developer?":"","In general, you will receive an update notification message while using software once we published a new version of CodeGen ToolBox. Just follow the steps and upgrade to the latest version.":"","Will CodeGen send unexpected requests with carrying my private data?":"","Is CodeGen ToolBox an Open-Source Software?":"","Can I run CodeGen service without a modal window?":"","Preview Version":"","Can I replaced the integrated JRE with my favourite one?":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"","Friendly reminder, please DO NOT download or upgrade CodeGen from any untrusted websites, it may bring unexpected latent risks to you, such as viruses, ADs, information leakages, etc.":"","In general, you will see a black modal window after executing the script. ":"","All Mac OS M1 Versions":"","The paragraph below will present how to start and stop CodeGen ToolBox step by step.":"","Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"","If you are using Windows operation system, please click {0} to start.":"","Yes, we already provided the system boot configuration for you, it's named \"system_boot.properties\" and is located in the config folder.":"","CodeGen will NEVER analyze or upload your files on this PC":"","Without the user’s definite permission, CodeGen will NEVER read/write your files or execute any unexpected operation.":"","Thank you for downloading CodeGen ToolBox! We would like to introduce its functions and common questions for you in the following chapters.":"","According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're platform listings as below we already supported":"","If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"","More options will be appended ASAP, please kindly stay tuned.":"","Definitely, you can do that.":"","Github Repository":"","By the way, we want to explain some requests we will send in case you maybe will get confused.":"","verify if current verrsion is available to use":"","All Linux Distributions":"","Factually, there's another way to shut down CodeGen service with ease, please refer to the screenshot below: ":"","Last but not least, since CodeGen is still under the Beta version. If you encountered any kind of errors that you cannot handle, or you may have any suggestions for the next features of CodeGen, please send an E-Mail or just create an issue on the Github repository, we would be honored if you would like to help us to improve the software.":"","Introduction":"","According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. Please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"","Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"","The guarantee for CodeGen Users":"","There's no latent vulnerability or unavailability issue inside preview version, you don't have to download preview and releasel version at the same time.":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"","Just simply close that dialog, then CodeGen will exit automatically. For more approaches that shutdown the CodeGen service expediently, we will consider proper solutions and upgrade its related logic in the following versions if possible.":"","To download CodeGen ToolBox, please refer to our official website {0} at first. You will see there're several options can be chose to download it.":"","CodeGen ToolBox":"","How to Download CodeGen":"","According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many popular platforms as we can, there're a platform listings as below we already supported":"","CodeGen is offline-able software, which means you can use it as well without the Internet.":"","Thanks and Regards":"","How many platforms will CodeGen service supports? ":"","Contact Developer":"","How to ":"","How to upgrade to the latest version for CodeGen ToolBox?":"","Can I replaced the integrated JDK with my favourite one?":"","verify if current route page is available to use":"","The guarantee for our users":"","Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"","Currently, we will launch a modal window to print latest program output. We will add hide window feature in the following versions, and at that time you can enjoy CodeGen ToolBox service in the background thread.":"","Factually, CodeGen Service will not be limited to some particular platforms. As long as your platform supports JRE and Node.js, CodeGen ToolBox is always able to support running over it.":"","By default, we already provided JRE 1.8 as the default environment of CodeGen. If you switched to the higher or lower JRE runtime, we cannot guarantee that version will be completely compatible with these written logic codes and related dependencies though we think it's workable possibly.":"","Just a friendly reminder, you should restart CodeGen service manually after having installed the latest version.":"","Please be noted there's no significant between preview version and released version, the preview version just obtains more latest functions than released version only.":"","How to start CodeGen service?":"","No, you can open your dev-tools by pressing the key F12 to audit whether CodeGen will send unexpected requests or not. But we want to ":"","Yes! Of course you can use CodeGen ToolBox without Internet. Except for some functions maybe need your internet environment, another functions will be available thought your PC cannot connect to Internet.":"","All Mac OS Intel Versions":"","You can find a rollback button in the update UI page, just simply click it and then you can switch it to the previous version.":"","We will never ever forever infringe upon user's privacy and interests, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"","How to Contribute CodeGen ToolBox?":"","Download CodeGen":"","If you really want this window to hide itself right now, you can write some script if you know how to hide it. ":"","According to the usage status of developer's platform, we don't support 32-bits since it's too old to run. No worries, please be assured that we will support as many platform as we can, there're platform listings as below we already supported":"","If you are using MacOS operation system, please click {0} to start.":"","Before starting CodeGen, please read this page at first.":"","We will never ever forever infringe upon user's privacy and interests as bold as brass, we hold the opinion that privacy matters above all things, meanwhile, to achieve this commitment, we hereby guarantee you the following items, but not limited to the following items: ":"","Shutdown CodeGen service on UI Page":""}