{
	"To Be Continued":"未完待续",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释，并对其源代码的漏洞进行审计，并将在适当的时候发布。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释并审计它的漏洞，我们会在适当的时候公布它的所有源代码。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释和审计漏洞，并将在适当的时候发布。",
	"Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"对不起，这份文件到目前为止还没有写完。我们会尽快出版的。",
	"If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您对CodeGen工具箱有任何疑问，请参考下面的联系信息：",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在对它的源代码添加必要的注释和易受攻击的检查，并将在适当的时候发布。",
	"If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您对CodeGen工具箱有任何疑问，请参考下面的联系信息：",
	"Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端服务源代码，对于服务器端，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"How to Contact Developer?":"如何联系开发商？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"是的，是这样的。但目前我们只公布了它的客户端源代码，对于服务器端的源代码，我们还在添加必要的注释并审计其漏洞，我们会在适当的时候发布它。",
	"Is CodeGen ToolBox an Open-Source Software?":"CodeGen工具箱是开源软件吗？",
	"QQ Chat Group":"QQ聊天群",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释和检查漏洞，并将在适当的时候发布。",
	"How to Contribute CodeGen ToolBox?":"如何贡献CodeGen工具箱？",
	"Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们公布了它的客户端服务源代码，关于服务器端，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"到目前为止，开发者还在完善相关的贡献文档和开发工具。如果您想了解CodeGen工具箱的基本信息，您可以先阅读我们的开源资源库，然后如果您有任何问题，可以随时联系我们。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在对它的源代码添加必要的注释，并将在适当的时候发布。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":"是的，是这样的。但目前我们只发布了它的客户端源代码，对于服务器端的源代码，我们还在为它的源代码添加必要的注释，并将在适当的时候发布。"
}