{
	"To Be Continued":"未完待續",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋，並對其源代碼的漏洞進行審計，並將在適當的時候發佈。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish its all source code at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋並審計它的漏洞，我們會在適當的時候公佈它的所有源代碼。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋和審計漏洞，並將在適當的時候發佈。",
	"Sorry, this document hasn't been finished yet so far. We will publish it ASAP.":"對不起，這份文件到目前爲止還沒有寫完。我們會儘快出版的。",
	"If you have any queries about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您對CodeGen工具箱有任何疑問，請參考下面的聯繫信息：",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and vulnerable checking for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在對它的源代碼添加必要的註釋和易受攻擊的檢查，並將在適當的時候發佈。",
	"If you have any question about CodeGen ToolBox, please kindly refer to the contact information as below:":"如果您對CodeGen工具箱有任何疑問，請參考下面的聯繫信息：",
	"Yes, it is. But currently we published its client service source code only, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端服務源代碼，對於服務器端，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"How to Contact Developer?":"如何聯繫開發商？",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and audit its vulnerability, we will publish it at the proper time.":"是的，是這樣的。但目前我們只公佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在添加必要的註釋並審計其漏洞，我們會在適當的時候發佈它。",
	"Is CodeGen ToolBox an Open-Source Software?":"CodeGen工具箱是開源軟件嗎？",
	"QQ Chat Group":"QQ聊天羣",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments and checking vulnerability for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋和檢查漏洞，並將在適當的時候發佈。",
	"How to Contribute CodeGen ToolBox?":"如何貢獻CodeGen工具箱？",
	"Yes, it is. But currently we published its client service source code, regarding the server side, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們公佈了它的客戶端服務源代碼，關於服務器端，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"Up to now, the developer is still consummating related contribute documentation and dev tools. If you would like to know the basis information about CodeGen Toolbox, you can read our open-source repository at first, and then if you have any question you can contact us at any time.":"到目前爲止，開發者還在完善相關的貢獻文檔和開發工具。如果您想瞭解CodeGen工具箱的基本信息，您可以先閱讀我們的開源資源庫，然後如果您有任何問題，可以隨時聯繫我們。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments over its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在對它的源代碼添加必要的註釋，並將在適當的時候發佈。",
	"Yes, it is. But currently we published its client side source code only, regarding the server side source code, we are still adding necessary comments for its source code and will publish it at the proper time.":"是的，是這樣的。但目前我們只發佈了它的客戶端源代碼，對於服務器端的源代碼，我們還在爲它的源代碼添加必要的註釋，並將在適當的時候發佈。"
}